## Plan Result (prod-prod)




<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.hearings.azurerm_dns_cname_record.this[&#34;_B38B307E1A87544793C9BDDD7A2824CB.sip.test&#34;]
  * module.hmcts_net.azurerm_dns_zone.zone
  * module.hmcts_net.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.hearings.azurerm_dns_cname_record.this["_B38B307E1A87544793C9BDDD7A2824CB.sip.test"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_b38b307e1a87544793c9bddd7a2824cb.sip.test"
      + record              = "E78A4271510F34AB3CC8523C32DE0CDA.BAB4AAACB04FE995F8D708245369D433.d8e32a33d7605e1d1ccc.sectigo.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 10800
      + zone_name           = "hearings.hmcts.net"
    }

  # module.hmcts_net.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.hmcts_net.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1128,"Program":"tfcmt","SHA1":"","Target":"prod-prod","Vars":{}} -->